# Rappels du langage Pythonüêç

## Les bases de la programmation

### Variables

On peut d√©finir des variables locales

In [233]:
a = 2

In [234]:
b = "Hello"

On peut supprimer une variable de la m√©moire

In [235]:
del a

In [236]:
a

NameError: name 'a' is not defined

### Structure conditionnelle

‚õî Il faut bien respecter une indentation sinon on sort de la structure conditionnelle

In [247]:
if (2 > 1):
    print("C'est vrai")

C'est vrai

In [248]:
if (2 > 3):
    print("C'est vrai")
else:
    print("c'est faux")

c'est faux

La fonction *input()* permet √† l'utilisateur de renseigner une valeur

In [ ]:
input()

In [ ]:
valeur = int(input())
if valeur < 5:
    print(str(valeur) + " est plus petit que 5")
elif valeur <= 10:
    print(str(valeur) + " est compris entre 5 et 10")
else :
    print(str(valeur) + " est plus grand que 10")

### Construire une fonction

In [ ]:
def calcul_IMC(poids = 60, taille = 1.70):
    imc = poids / taille**2
    return(imc)

In [ ]:
calcul_IMC(poids = float(input("Quel poids (en kg) ? ")) ,
           taille = float(input("Quelle taille (en metres) ? ")))

On est pas oblig√© de renseigner le nom des arguments s'ils sont renseign√©s dans le m√™me ordre de l'impl√©mentation de la fonction

In [ ]:
calcul_IMC(50,1.66)

L'ordre des arguments n'est pas important si on les renseigne

In [ ]:
calcul_IMC(taille = 1.66, poids = 50)

Avec des arguments par d√©faut

In [ ]:
def calcul_IMC(poids = 60, taille = 1.70):
    imc = poids / taille**2
    return(imc)

In [ ]:
calcul_IMC()

In [ ]:
calcul_IMC(poids = 80)

### Boucles

#### FOR

La variable *nb* correspond au nombre d'it√©ration de la boucle

‚õî Il faut bien respecter une indentation sinon on sort de la structure

In [ ]:
nb = int(input())
for i in range(1,nb):
    un_poids = float(input("Quel poids (en kg) ? "))
    une_taille = float(input("Quelle taille (en metres) ? "))
    print(calcul_IMC(un_poids,une_taille))

‚ö† La valeur de la borne droite d'une fonction *range()* est ouverte. Donc quand nb = 3, la boucle est lanc√©e deux fois.

#### WHILE

‚ö† Il est important d'exprimer une condition d'arr√™t pour ne pas avoir de boucle infinie

In [ ]:
nb = int(input())
i = 1
while i <= nb:
    un_poids = float(input("Quel poids (en kg) ? "))
    une_taille = float(input("Quelle taille (en metres) ? "))
    print(calcul_IMC(un_poids,une_taille))
    i=i+1

### Liste

On utilis les crochets [ ] pour d√©finir une liste

In [250]:
liste = [1,2,3,4]
liste

[1, 2, 3, 4]

La m√©thode *append( )* permet d'ajouter un √©l√©ment √† une liste

In [251]:
liste.append(8)
liste

[1, 2, 3, 4, 8]

La m√©thode *extend( )* permet d'ajouter une liste √† la fin d'une liste

In [252]:
liste.extend([1,2,3])
liste

[1, 2, 3, 4, 8, 1, 2, 3]

La fonction *len( )* renvoie la longueur d'une liste

In [253]:
len(liste)

8

Pour acceder aux √©l√©ments d'une liste on utilise les crochets [ ] . <br>
‚ö† L'indexation commence √† 0

In [254]:
liste[0]

1

In [255]:
liste[0:5]

[1, 2, 3, 4, 8]

### Librairies

Lorsqu'on installe python, plusieurs librairies sont install√©es par d√©faut. G√©n√©ralement, il est n√©cessaire d'en installer d'autres. Par exemple la librairie **numpy** permet de manipuler des matrices et des listes. Il est recommand√© d'installer des libraries via le terminal avec la commande *pip install nom_librairie* ou par un navigateur. Une fois install√©, il faut import la librairie pour  l'utiliser.

In [256]:
import numpy

On recommande souvent de mettre un alias pour une librairie et √©viter d'avoir √† saisir le nom complet de la librairie √† chaque usage de ses fonctions

In [257]:
import numpy as np

#### Numpy

Voici quelques fonctions utiles de la librairie **numpy**

La fonction *linspace( )* g√©n√®re une s√©quence de *n* nombre

In [258]:
np.linspace(start= 0 , stop = 1, num = 9)

array([0.   , 0.125, 0.25 , 0.375, 0.5  , 0.625, 0.75 , 0.875, 1.   ])

La fonction *arange( )* g√©n√®re une s√©quence avec un step *n* <br>
‚ö† La valeur *stop* n'est pas prise en compte

In [259]:
np.arange(start= 0 , stop = 1, step = 0.1)

array([0. , 0.1, 0.2, 0.3, 0.4, 0.5, 0.6, 0.7, 0.8, 0.9])

# **L'essentiel de üêº**

Dans ce notebook, nous allons voir l'essentiel de la manipulation de tableaux sous Python. Des notions importantes dans une d√©marche data science !

## Importer la librairie pandas

on peut donc charger la librairie, la plupart du temps on lui associe un alias

In [260]:
import pandas as pd

‚ö† Certaines fonctionnalit√©s sont disponibles qu'√† partir de certaines versions de pandas.

In [261]:
#Afficher la version de pandas
pd.__version__

'1.2.3'

## Importer un jeu de donn√©es

On importe le jeu de donn√©es avec la m√©thode read_*mon_format*() selon l'extension du fichier

In [262]:
df = pd.read_csv("../Dataset/Titanic.csv")

On affiche un extrait du tableau avec la m√©thode *head()*

In [263]:
df.head(2)

,Unnamed: 0,Name,PClass,Age,Sex,Survived,SexCode
0,1,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
1,2,"Allison, Miss Helen Loraine",1st,2.0,female,0,1

On supprime la premi√®re colonne inutile

In [264]:
df.drop(['Unnamed: 0'], axis=1, inplace=True)

On utilise la m√©thode *shape* pour afficher le nombre de lignes et colonnes

In [265]:
df.shape

(1313, 6)

On utilise  la m√©thode *info()* ou *dtypes* pour afficher une description du data frame

In [266]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1313 entries, 0 to 1312
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      1313 non-null   object
 1   PClass    1313 non-null   object
 2   Age       756 non-null    float64
 3   Sex       1313 non-null   object
 4   Survived  1313 non-null   int64
 5   SexCode   1313 non-null   int64
dtypes: float64(1), int64(2), object(3)
memory usage: 61.7+ KB

In [267]:
df.dtypes

Name         object
PClass       object
Age         float64
Sex          object
Survived      int64
SexCode       int64
dtype: object

## Manipuler un jeu de donn√©es

### Interroger le data frame avec le nom des colonnes

In [268]:
df.PClass

0       1st
1       1st
2       1st
3       1st
4       1st
       ...
1308    3rd
1309    3rd
1310    3rd
1311    3rd
1312    3rd
Name: PClass, Length: 1313, dtype: object

In [269]:
df['PClass']

0       1st
1       1st
2       1st
3       1st
4       1st
       ...
1308    3rd
1309    3rd
1310    3rd
1311    3rd
1312    3rd
Name: PClass, Length: 1313, dtype: object

Tester le type de l'objet que renvoie la m√©thode *type()* sur une colonne du dataframe

In [270]:
type(df['PClass'])

pandas.core.series.Series

Nous n'avons pas l'information sur le type des donn√©es que rassemble cette colonne. En revanche, l'objet est une s√©rie pandas. Avec pandas, les diff√©rents vecteurs ou colonnes d''une dataframe sont appel√©es "Series". Un DataFrame pandas est donc une collection de pd.Series.

S√©lectionner deux colonnes en m√™mes temps

In [271]:
df[['Name','PClass']]

                                               Name PClass
0                      Allen, Miss Elisabeth Walton    1st
1                       Allison, Miss Helen Loraine    1st
2               Allison, Mr Hudson Joshua Creighton    1st
3     Allison, Mrs Hudson JC (Bessie Waldo Daniels)    1st
4                     Allison, Master Hudson Trevor    1st
...                                             ...    ...
1308                             Zakarian, Mr Artun    3rd
1309                         Zakarian, Mr Maprieder    3rd
1310                               Zenni, Mr Philip    3rd
1311                               Lievens, Mr Rene    3rd
1312                                 Zimmerman, Leo    3rd

[1313 rows x 2 columns]

Il suffit de donner une liste avec des noms de colonnes. <br> 
‚ö† L'ordre des colonnes renvoy√© est le m√™me que celles de la liste

In [272]:
df[['PClass','Name']]

     PClass                                           Name
0       1st                   Allen, Miss Elisabeth Walton
1       1st                    Allison, Miss Helen Loraine
2       1st            Allison, Mr Hudson Joshua Creighton
3       1st  Allison, Mrs Hudson JC (Bessie Waldo Daniels)
4       1st                  Allison, Master Hudson Trevor
...     ...                                            ...
1308    3rd                             Zakarian, Mr Artun
1309    3rd                         Zakarian, Mr Maprieder
1310    3rd                               Zenni, Mr Philip
1311    3rd                               Lievens, Mr Rene
1312    3rd                                 Zimmerman, Leo

[1313 rows x 2 columns]

Des lors que l'objet retoun√© a plus de 1 une colonne, c'est un objet pandas *DataFrame* et non pandas *Series*

In [273]:
type(df[['PClass','Name']])

pandas.core.frame.DataFrame

### Interroger le data frame avec les indices lignes/colonnes

La m√©thode *iloc[ ]* permet d'interroger un data frame Pandas avec les indices

In [274]:
#Afficher la premi√®re ligne
df.iloc[0]

Name        Allen, Miss Elisabeth Walton
PClass                               1st
Age                                 29.0
Sex                               female
Survived                               1
SexCode                                1
Name: 0, dtype: object

In [275]:
#Afficher la premi√®re colonne
df.iloc[:,0]

0                        Allen, Miss Elisabeth Walton
1                         Allison, Miss Helen Loraine
2                 Allison, Mr Hudson Joshua Creighton
3       Allison, Mrs Hudson JC (Bessie Waldo Daniels)
4                       Allison, Master Hudson Trevor
                            ...
1308                               Zakarian, Mr Artun
1309                           Zakarian, Mr Maprieder
1310                                 Zenni, Mr Philip
1311                                 Lievens, Mr Rene
1312                                   Zimmerman, Leo
Name: Name, Length: 1313, dtype: object

In [276]:
#Afficher les 3 premi√®res lignes de la premi√®re colonne
df.iloc[:3,0]

0           Allen, Miss Elisabeth Walton
1            Allison, Miss Helen Loraine
2    Allison, Mr Hudson Joshua Creighton
Name: Name, dtype: object

In [277]:
#Afficher les 3 premi√®res lignes
df.iloc[0:3,:]

                                  Name PClass   Age     Sex  Survived  SexCode
0         Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1          Allison, Miss Helen Loraine    1st   2.0  female         0        1
2  Allison, Mr Hudson Joshua Creighton    1st  30.0    male         0        0

‚ö† En python, la borne ext√©rieure d'une <font color=red> plage  </font> est toujours ouverte, c'est pourquoi la ligne d'indice 3 correspondant √† la ligne 4 ne s'affiche pas contrairement √† une liste

In [278]:
#Afficher les 3 premi√®res lignes
df.iloc[ [0,1,2,3] ,:]

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.0,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1

In [279]:
#Afficher la derni√®re lignes
df.iloc[-1,:]

Name        Zimmerman, Leo
PClass                 3rd
Age                   29.0
Sex                   male
Survived                 0
SexCode                  0
Name: 1312, dtype: object

La m√©thode *loc[ ]* permet d'interroger un data frame Pandas avec le nom des lignes **et** des colonnes

In [280]:
df.loc[:, ['PClass','Name']]

     PClass                                           Name
0       1st                   Allen, Miss Elisabeth Walton
1       1st                    Allison, Miss Helen Loraine
2       1st            Allison, Mr Hudson Joshua Creighton
3       1st  Allison, Mrs Hudson JC (Bessie Waldo Daniels)
4       1st                  Allison, Master Hudson Trevor
...     ...                                            ...
1308    3rd                             Zakarian, Mr Artun
1309    3rd                         Zakarian, Mr Maprieder
1310    3rd                               Zenni, Mr Philip
1311    3rd                               Lievens, Mr Rene
1312    3rd                                 Zimmerman, Leo

[1313 rows x 2 columns]

L'association des m√©thodes *columns* et *difference* permet d'afficher toutes les colonnes d'un data frame except√©es celles mentionn√©es

In [281]:
df.columns.difference(['Age','SexCode'])

Index(['Name', 'PClass', 'Sex', 'Survived'], dtype='object')

On r√©utilise cette liste sans les variables mentionn√©es directement dans l'indexation du data frame

In [282]:
df[  df.columns.difference(['Age','SexCode'])  ].head(3)

                                  Name PClass     Sex  Survived
0         Allen, Miss Elisabeth Walton    1st  female         1
1          Allison, Miss Helen Loraine    1st  female         0
2  Allison, Mr Hudson Joshua Creighton    1st    male         0

üì¢ Attention : Lorqu'on utilise cette m√©thode, la liste des colonnes affich√©es est tri√©e par ordre alphabetique ce qui conduit √† une r√©organisation du tableau de d√©part

In [283]:
df.columns

Index(['Name', 'PClass', 'Age', 'Sex', 'Survived', 'SexCode'], dtype='object')

In [284]:
df.columns.difference([''])

Index(['Age', 'Name', 'PClass', 'Sex', 'SexCode', 'Survived'], dtype='object')

### Interroger le data frame avec des filtres

Pour cela on utilise les op√©rateurs logiques qui permettent de renvoyer des bool√©ens.

In [285]:
#Tester une √©galit√©
df.PClass == "1st"

0        True
1        True
2        True
3        True
4        True
        ...
1308    False
1309    False
1310    False
1311    False
1312    False
Name: PClass, Length: 1313, dtype: bool

In [286]:
df[df.PClass == "1st"]

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0
...,...,...,...,...,...,...
317,"Robbins, Mr Victor",1st,NaN,male,0,0
318,"Segesser, Mlle Emma",1st,NaN,female,1,1
319,"Seredeca, Ms",1st,NaN,female,0,1
320,"Ward, Ms Anna",1st,NaN,female,0,1
321,"Wilson, Ms Helen",1st,NaN,female,1,1

In [287]:
#Tester une diff√©rence
df.PClass != "3rd"

0        True
1        True
2        True
3        True
4        True
        ...
1308    False
1309    False
1310    False
1311    False
1312    False
Name: PClass, Length: 1313, dtype: bool

In [288]:
df[df.PClass != "3rd"]

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0
...,...,...,...,...,...,...
597,"Yrois, Miss Henriette",2nd,NaN,female,0,1
598,"Aldworth, Mr Charles Augustus",2nd,30.00,male,0,0
599,"Brown, Miss Mildred",2nd,24.00,female,1,1
600,"Pernot, Mr Rene",2nd,NaN,male,0,0
601,"Swane, Mr George",2nd,18.00,male,0,0

In [289]:
#Tester si sup√©rieur
df.Age > 20

0        True
1       False
2        True
3        True
4       False
        ...
1308     True
1309     True
1310     True
1311     True
1312     True
Name: Age, Length: 1313, dtype: bool

In [290]:
df[df.Age > 20]

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.0,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1
5,"Anderson, Mr Harry",1st,47.0,male,1,0
6,"Andrews, Miss Kornelia Theodosia",1st,63.0,female,1,1
...,...,...,...,...,...,...
1308,"Zakarian, Mr Artun",3rd,27.0,male,0,0
1309,"Zakarian, Mr Maprieder",3rd,26.0,male,0,0
1310,"Zenni, Mr Philip",3rd,22.0,male,0,0
1311,"Lievens, Mr Rene",3rd,24.0,male,0,0
1312,"Zimmerman, Leo",3rd,29.0,male,0,0

In [291]:
#Tester si comris dans des bornes
(df.Age > 15) & (df.Age < 30)

0        True
1       False
2       False
3        True
4       False
        ...
1308     True
1309     True
1310     True
1311     True
1312     True
Name: Age, Length: 1313, dtype: bool

In [292]:
df[(df.Age > 15) & (df.Age < 30)]

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1
11,"Astor, Mrs John Jacob (Madeleine Talmadge Force)",1st,19.0,female,1,1
16,"Baxter, Mr Quigg Edmond",1st,24.0,male,0,0
20,"Behr, Mr Karl Howell",1st,26.0,male,1,0
...,...,...,...,...,...,...
1308,"Zakarian, Mr Artun",3rd,27.0,male,0,0
1309,"Zakarian, Mr Maprieder",3rd,26.0,male,0,0
1310,"Zenni, Mr Philip",3rd,22.0,male,0,0
1311,"Lievens, Mr Rene",3rd,24.0,male,0,0
1312,"Zimmerman, Leo",3rd,29.0,male,0,0

In [293]:
#Tester avec deux valeurs possibles 
(df.PClass == "1st") | (df.PClass == "2nd")

0        True
1        True
2        True
3        True
4        True
        ...
1308    False
1309    False
1310    False
1311    False
1312    False
Name: PClass, Length: 1313, dtype: bool

In [294]:
df[(df.PClass == "1st") | (df.PClass == "2nd")]

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0
...,...,...,...,...,...,...
597,"Yrois, Miss Henriette",2nd,NaN,female,0,1
598,"Aldworth, Mr Charles Augustus",2nd,30.00,male,0,0
599,"Brown, Miss Mildred",2nd,24.00,female,1,1
600,"Pernot, Mr Rene",2nd,NaN,male,0,0
601,"Swane, Mr George",2nd,18.00,male,0,0

In [295]:
#Tester si compris dans la liste
df.PClass.isin(['1st', '2nd'])

0        True
1        True
2        True
3        True
4        True
        ...
1308    False
1309    False
1310    False
1311    False
1312    False
Name: PClass, Length: 1313, dtype: bool

In [296]:
df[df.PClass.isin(['1st', '2nd'])]

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0
...,...,...,...,...,...,...
597,"Yrois, Miss Henriette",2nd,NaN,female,0,1
598,"Aldworth, Mr Charles Augustus",2nd,30.00,male,0,0
599,"Brown, Miss Mildred",2nd,24.00,female,1,1
600,"Pernot, Mr Rene",2nd,NaN,male,0,0
601,"Swane, Mr George",2nd,18.00,male,0,0

In [297]:
#Tester si n'est pas compris dans la liste
~ df.PClass.isin(['1st', '2nd'])

0       False
1       False
2       False
3       False
4       False
        ...
1308     True
1309     True
1310     True
1311     True
1312     True
Name: PClass, Length: 1313, dtype: bool

In [298]:
~pd.Series([True,False,True,True])

0    False
1     True
2    False
3    False
dtype: bool

En r√©alit√©, l'op√©rateur **~** permet de renvoyer l'inverse des tests logiques effectu√©s

In [299]:
df[~ df.PClass.isin(['1st', '2nd'])]

                              Name PClass   Age     Sex  Survived  SexCode
602             Abbing, Mr Anthony    3rd  42.0    male         0        0
603   Abbott, Master Eugene Joseph    3rd  13.0    male         0        0
604     Abbott, Mr Rossmore Edward    3rd  16.0    male         0        0
605     Abbott, Mrs Stanton (Rosa)    3rd  35.0  female         1        1
606      Abelseth, Miss Anna Karen    3rd  16.0  female         1        1
...                            ...    ...   ...     ...       ...      ...
1308            Zakarian, Mr Artun    3rd  27.0    male         0        0
1309        Zakarian, Mr Maprieder    3rd  26.0    male         0        0
1310              Zenni, Mr Philip    3rd  22.0    male         0        0
1311              Lievens, Mr Rene    3rd  24.0    male         0        0
1312                Zimmerman, Leo    3rd  29.0    male         0        0

[711 rows x 6 columns]

Les m√©thodes *isna()* et *notna()* permettent d'effectuer des filtres sur des valeurs manquantes

In [300]:
df.Age.isna()

0       False
1       False
2       False
3       False
4       False
        ...
1308    False
1309    False
1310    False
1311    False
1312    False
Name: Age, Length: 1313, dtype: bool

In [301]:
df[df.Age.isna()]

                              Name PClass  Age     Sex  Survived  SexCode
12    Aubert, Mrs Leontine Pauline    1st  NaN  female         1        1
13        Barkworth, Mr Algernon H    1st  NaN    male         1        0
14              Baumann, Mr John D    1st  NaN    male         0        0
29         Borebank, Mr John James    1st  NaN    male         0        0
32              Bradley, Mr George    1st  NaN    male         1        0
...                            ...    ...  ...     ...       ...      ...
1300         Wiseman, Mr Phillippe    3rd  NaN    male         0        0
1302             Yalsevac, Mr Ivan    3rd  NaN    male         1        0
1305            Youssef, Mr Gerios    3rd  NaN    male         0        0
1306           Zabour, Miss Hileni    3rd  NaN  female         0        1
1307           Zabour, Miss Tamini    3rd  NaN  female         0        1

[557 rows x 6 columns]

In [302]:
df.Age.notna()

0       True
1       True
2       True
3       True
4       True
        ...
1308    True
1309    True
1310    True
1311    True
1312    True
Name: Age, Length: 1313, dtype: bool

In [303]:
df[df.Age.notna()]

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0
...,...,...,...,...,...,...
1308,"Zakarian, Mr Artun",3rd,27.00,male,0,0
1309,"Zakarian, Mr Maprieder",3rd,26.00,male,0,0
1310,"Zenni, Mr Philip",3rd,22.00,male,0,0
1311,"Lievens, Mr Rene",3rd,24.00,male,0,0
1312,"Zimmerman, Leo",3rd,29.00,male,0,0

### Trier un jeu de donn√©es

On utilise la m√©thode *sort_values()* pour trier un data frame ou une s√©rie pandas

In [304]:
#On trie la s√©rie Age
df.Age.sort_values()

763     0.17
751     0.33
544     0.80
616     0.83
358     0.83
        ...
1300     NaN
1302     NaN
1305     NaN
1306     NaN
1307     NaN
Name: Age, Length: 1313, dtype: float64

In [305]:
#On trie la s√©rie Age par ordre d√©croissant
df.Age.sort_values(ascending=False)

505     71.0
119     71.0
9       71.0
72      70.0
73      69.0
        ...
1300     NaN
1302     NaN
1305     NaN
1306     NaN
1307     NaN
Name: Age, Length: 1313, dtype: float64

In [306]:
# On trie le data frame
df.sort_values(by = 'Age', ascending=False)

,Name,PClass,Age,Sex,Survived,SexCode
505,"Mitchell, Mr Henry Michael",2nd,71.0,male,0,0
119,"Goldschmidt, Mr George B",1st,71.0,male,0,0
9,"Artagaveytia, Mr Ramon",1st,71.0,male,0,0
72,"Crosby, Captain Edward Gifford",1st,70.0,male,0,0
73,"Crosby, Mrs Edward Gifford (Catherine Elizabet...",1st,69.0,female,1,1
...,...,...,...,...,...,...
1300,"Wiseman, Mr Phillippe",3rd,NaN,male,0,0
1302,"Yalsevac, Mr Ivan",3rd,NaN,male,1,0
1305,"Youssef, Mr Gerios",3rd,NaN,male,0,0
1306,"Zabour, Miss Hileni",3rd,NaN,female,0,1
1307,"Zabour, Miss Tamini",3rd,NaN,female,0,1

In [307]:
# On trie le data frame avec selon plusieurs colonnes
df.sort_values(by = ['PClass','Age'], ascending=[True,False])

,Name,PClass,Age,Sex,Survived,SexCode
9,"Artagaveytia, Mr Ramon",1st,71.0,male,0,0
119,"Goldschmidt, Mr George B",1st,71.0,male,0,0
72,"Crosby, Captain Edward Gifford",1st,70.0,male,0,0
73,"Crosby, Mrs Edward Gifford (Catherine Elizabet...",1st,69.0,female,1,1
252,"Straus, Mr Isidor",1st,67.0,male,0,0
...,...,...,...,...,...,...
1300,"Wiseman, Mr Phillippe",3rd,NaN,male,0,0
1302,"Yalsevac, Mr Ivan",3rd,NaN,male,1,0
1305,"Youssef, Mr Gerios",3rd,NaN,male,0,0
1306,"Zabour, Miss Hileni",3rd,NaN,female,0,1
1307,"Zabour, Miss Tamini",3rd,NaN,female,0,1

## Exploration statistique sur un jeu de donn√©es

On utilise souvent la librairie *numpy* avec pandas

In [308]:
import numpy as np

### Indicateurs statistiques

In [309]:
df.Age.mean()

30.397989417989415

In [310]:
df.Age.median()

28.0

In [311]:
df.Age.max()

71.0

In [312]:
df.Age.std()

14.259048710359023

In [313]:
df.Age.var()

203.32047012439133

In [314]:
df.Age.quantile([.1, .5])

0.1    16.0
0.5    28.0
Name: Age, dtype: float64

In [315]:
df.Age.quantile(np.linspace(start = 0, stop = 1, num= 11))

0.0     0.17
0.1    16.00
0.2    20.00
0.3    22.00
0.4    25.00
0.5    28.00
0.6    32.00
0.7    36.00
0.8    43.00
0.9    50.00
1.0    71.00
Name: Age, dtype: float64

La m√©thode *describe()* calcule des statistiques √©l√©mentaires sur les donn√©es

In [316]:
df.describe()

              Age     Survived      SexCode
count  756.000000  1313.000000  1313.000000
mean    30.397989     0.342727     0.351866
std     14.259049     0.474802     0.477734
min      0.170000     0.000000     0.000000
25%     21.000000     0.000000     0.000000
50%     28.000000     0.000000     0.000000
75%     39.000000     1.000000     1.000000
max     71.000000     1.000000     1.000000

L'argument *include* permet de prendre en compte toutes les colonnes quelques soit leur type

In [317]:
df.describe(include = "all")

                       Name PClass         Age   Sex     Survived      SexCode
count                  1313   1313  756.000000  1313  1313.000000  1313.000000
unique                 1310      3         NaN     2          NaN          NaN
top     Connolly, Miss Kate    3rd         NaN  male          NaN          NaN
freq                      2    711         NaN   851          NaN          NaN
mean                    NaN    NaN   30.397989   NaN     0.342727     0.351866
std                     NaN    NaN   14.259049   NaN     0.474802     0.477734
min                     NaN    NaN    0.170000   NaN     0.000000     0.000000
25%                     NaN    NaN   21.000000   NaN     0.000000     0.000000
50%                     NaN    NaN   28.000000   NaN     0.000000     0.000000
75%                     NaN    NaN   39.000000   NaN     1.000000     1.000000
max                     NaN    NaN   71.000000   NaN     1.000000     1.000000

In [318]:
df.describe(exclude=[np.number])

                       Name PClass   Sex
count                  1313   1313  1313
unique                 1310      3     2
top     Connolly, Miss Kate    3rd  male
freq                      2    711   851

In [319]:
df.describe(include=[np.number])

              Age     Survived      SexCode
count  756.000000  1313.000000  1313.000000
mean    30.397989     0.342727     0.351866
std     14.259049     0.474802     0.477734
min      0.170000     0.000000     0.000000
25%     21.000000     0.000000     0.000000
50%     28.000000     0.000000     0.000000
75%     39.000000     1.000000     1.000000
max     71.000000     1.000000     1.000000

L'argument *percentiles* permet d'avoir la main sur les quantiles affich√©s

In [320]:
df.describe(percentiles=np.linspace(start = 0, stop = 1, num= 11))

              Age     Survived      SexCode
count  756.000000  1313.000000  1313.000000
mean    30.397989     0.342727     0.351866
std     14.259049     0.474802     0.477734
min      0.170000     0.000000     0.000000
0%       0.170000     0.000000     0.000000
10%     16.000000     0.000000     0.000000
20%     20.000000     0.000000     0.000000
30%     22.000000     0.000000     0.000000
40%     25.000000     0.000000     0.000000
50%     28.000000     0.000000     0.000000
60%     32.000000     0.000000     0.000000
70%     36.000000     1.000000     1.000000
80%     43.000000     1.000000     1.000000
90%     50.000000     1.000000     1.000000
100%    71.000000     1.000000     1.000000
max     71.000000     1.000000     1.000000

La m√©thode *unique()* renvoie une liste des valeurs uniques d'une *Series* pandas

In [321]:
df.PClass.unique()

array(['1st', '2nd', '3rd'], dtype=object)

La m√©thode *nunique()* compte le nombre de valeurs uniques d'une *Series* pandas

In [322]:
df.PClass.nunique()

3

Cela fonctionne aussi sur un data frame

In [323]:
df.nunique()

Name        1310
PClass         3
Age           75
Sex            2
Survived       2
SexCode        2
dtype: int64

La m√©thode *value_counts()* renvoie un tri √† plat d'une *Series* pandas

In [324]:
df.PClass.value_counts()

3rd    711
1st    322
2nd    280
Name: PClass, dtype: int64

In [325]:
#en pourcentage
df.PClass.value_counts(normalize=True)

3rd    0.541508
1st    0.245240
2nd    0.213252
Name: PClass, dtype: float64

### Grouper les donn√©es

#### Tableaux crois√©s

La m√©thode *crosstab()* permet de calculer un tableau crois√©

In [326]:
pd.crosstab(df.PClass, df.Sex, margins=True)

Sex     female  male   All
PClass
1st        143   179   322
2nd        107   173   280
3rd        212   499   711
All        462   851  1313

In [327]:
#pourcentage total g√©n√©ral
pd.crosstab(df.PClass, df.Sex, margins=True, normalize = True)

Sex       female      male       All
PClass
1st     0.108911  0.136329  0.245240
2nd     0.081493  0.131759  0.213252
3rd     0.161462  0.380046  0.541508
All     0.351866  0.648134  1.000000

Pour un tableau crois√© en pourcentage on utilise la m√©thode *apply()* permet de mapper une fonction sur tout les √©l√©ments de l'objet

In [328]:
#pourcentage colonne
pd.crosstab(df.PClass, df.Sex).apply(lambda x: x/x.sum(), axis=0)

Sex       female      male
PClass
1st     0.309524  0.210341
2nd     0.231602  0.203290
3rd     0.458874  0.586369

In [329]:
#pourcentage ligne
pd.crosstab(df.PClass, df.Sex).apply(lambda x: x/x.sum(), axis=1)

Sex       female      male
PClass
1st     0.444099  0.555901
2nd     0.382143  0.617857
3rd     0.298172  0.701828

#### Agr√©gation

On utilise la m√©thode *groupby()* pour grouper les donn√©es. Il faut ensuite utiliser *agg()* pour calculer des indicateurs pour chaque groupe

In [330]:
df.groupby(['PClass']).Age.agg([min, max])

         min   max
PClass
1st     0.92  71.0
2nd     0.80  71.0
3rd     0.17  65.0

On peut grouper les donn√©es selon plusieurs variables

In [331]:
df.groupby(['PClass','Sex']).Age.agg([min, max])

                min   max
PClass Sex
1st    female  2.00  69.0
       male    0.92  71.0
2nd    female  1.00  57.0
       male    0.80  71.0
3rd    female  0.17  63.0
       male    0.33  65.0

On peut aussi utiliser un dictionnaire

In [332]:
df_agg = df.groupby(['PClass','Sex']).agg( { 'Age' : ['min','max'] , 'PClass' : 'count'  })
df_agg

                Age       PClass
                min   max  count
PClass Sex
1st    female  2.00  69.0    143
       male    0.92  71.0    179
2nd    female  1.00  57.0    107
       male    0.80  71.0    173
3rd    female  0.17  63.0    212
       male    0.33  65.0    499

Ce code permet d'√©liminer les  deux niveaux d'index colonne en concatenant les noms

In [333]:
df_agg.columns = ['_'.join(col) for col in df_agg.columns]
df_agg

               Age_min  Age_max  PClass_count
PClass Sex
1st    female     2.00     69.0           143
       male       0.92     71.0           179
2nd    female     1.00     57.0           107
       male       0.80     71.0           173
3rd    female     0.17     63.0           212
       male       0.33     65.0           499

‚ö† Le r√©sultat utilise plusieurs index pour chaque ligne et colonne.

On utilise la m√©thode *reset_index()* pour mettre les index ligne en colonne

In [334]:
df.groupby(['PClass','Sex']).Age.agg([min, max]).reset_index()

  PClass     Sex   min   max
0    1st  female  2.00  69.0
1    1st    male  0.92  71.0
2    2nd  female  1.00  57.0
3    2nd    male  0.80  71.0
4    3rd  female  0.17  63.0
5    3rd    male  0.33  65.0

## Modifier un jeu de donn√©es

### Changement de type des variables

In [335]:
df.dtypes

Name         object
PClass       object
Age         float64
Sex          object
Survived      int64
SexCode       int64
dtype: object

On transforme la variable *Survived* en caract√®re

In [336]:
df.Survived = df.Survived.astype('str')
df.dtypes

Name         object
PClass       object
Age         float64
Sex          object
Survived     object
SexCode       int64
dtype: object

On la repasse en num√©rique

In [337]:
df.Survived = df.Survived.astype('int')
df.dtypes

Name         object
PClass       object
Age         float64
Sex          object
Survived      int64
SexCode       int64
dtype: object

#### Renommer des colonnes

In [338]:
df.columns

Index(['Name', 'PClass', 'Age', 'Sex', 'Survived', 'SexCode'], dtype='object')

On utilise la m√©thode *rename()* pour renommer une colonne

In [339]:
df.rename(columns={'PClass': 'Classe passager',
                  'Age': 'Age passager'}, inplace=True)

In [340]:
df.columns

Index(['Name', 'Classe passager', 'Age passager', 'Sex', 'Survived',
       'SexCode'],
      dtype='object')

üí° Quelques fois, il est p√©nible de manipuler des variables avec des espaces, voici une commande pour remplacer les espaces par un  '_'

In [341]:
df.columns = df.columns.str.replace(' ', '_')
df.columns

Index(['Name', 'Classe_passager', 'Age_passager', 'Sex', 'Survived',
       'SexCode'],
      dtype='object')

On remet le nom des colonnes d'origine

In [342]:
df.rename(columns={'Classe_passager': 'PClass',
                  'Age_passager': 'Age'}, inplace=True)

### Gerer les valeurs manquantes

#### Remplacer avec *fillna()*

On observe les valeurs manquantes pr√©sentent dans la variable age

In [343]:
df.rename(columns={'Age_passager': 'Age'}, inplace=True)

In [344]:
df.Age.isna().value_counts()

False    756
True     557
Name: Age, dtype: int64

In [345]:
df.Age.describe()

count    756.000000
mean      30.397989
std       14.259049
min        0.170000
25%       21.000000
50%       28.000000
75%       39.000000
max       71.000000
Name: Age, dtype: float64

On remplace les valeurs manquantes par des 0 avec la m√©thode *fillna()* dans une nouvelle colonne

In [346]:
df['Age_fillna_0'] = df.Age.fillna(0)

On remarque qu'il n'y a plus de valeurs manquantes

In [347]:
df.Age_fillna_0.isna().value_counts()

False    1313
Name: Age_fillna_0, dtype: int64

‚ö† Cela modifie la structure des donn√©es (ex : moyenne)

In [348]:
df.Age_fillna_0.describe()

count    1313.000000
mean       17.502574
std        18.516945
min         0.000000
25%         0.000000
50%        18.000000
75%        30.000000
max        71.000000
Name: Age_fillna_0, dtype: float64

L'astuce pourrait-√™tre de remplacer les valeurs manquantes par la moyenne ?

In [349]:
#calcul de la moyenne
mean = df.Age.mean()

On remplace par la moyenne

In [350]:
df['Age_fillna_mean'] = df.Age.fillna(mean)

‚ö† Cela modifie la structure des donn√©es sauf la moyenne

In [351]:
df.Age_fillna_mean.describe()

count    1313.000000
mean       30.397989
std        10.816758
min         0.170000
25%        26.000000
50%        30.397989
75%        30.397989
max        71.000000
Name: Age_fillna_mean, dtype: float64

R√©capitulatif des m√©thodes utilis√©es

In [352]:
df[df.Age.isna()].iloc[:,[2,6,7]]

      Age  Age_fillna_0  Age_fillna_mean
12    NaN           0.0        30.397989
13    NaN           0.0        30.397989
14    NaN           0.0        30.397989
29    NaN           0.0        30.397989
32    NaN           0.0        30.397989
...   ...           ...              ...
1300  NaN           0.0        30.397989
1302  NaN           0.0        30.397989
1305  NaN           0.0        30.397989
1306  NaN           0.0        30.397989
1307  NaN           0.0        30.397989

[557 rows x 3 columns]

On supprime les colonnes cr√©es

In [353]:
df.drop(columns=['Age_fillna_0', 'Age_fillna_mean'], inplace=True)

#### Supprimer avec *dropna()*

Une autre m√©thode plus radicale consiste √† supprimer les observations ou colonnes avec des valeurs manquantes. On utilise la m√©thode *dropna()* avec :

* axis = 0 pour les lignes et 1 pour les colonnes
* how = 'all' si des NaN sur l'ensemble des les lignes/ colonne ouf how = 'any' si au moins un NaN sur l'ensemble des les lignes/ colonne

In [354]:
df.dropna(axis=0, how="all").shape

(1313, 6)

In [355]:
df.dropna(axis=0, how="any").shape

(756, 6)

‚ö† On peut utiliser l'argument *inplace = True* pour modifier directement le data frame

In [356]:
#avant le dropna()
df.shape

(1313, 6)

In [357]:
df.dropna(axis=0, how="any", inplace=True)

In [358]:
#apr√®s le dropna()
df.shape

(756, 6)

#### Remplacer avec *KNNImputer()*

Cette m√©thode consiste √† utiliser l'algorithme des K-plus proches voisins. <br> https://scikit-learn.org/stable/modules/generated/sklearn.impute.KNNImputer.html

In [359]:
d = {'x': [5, 10, np.nan, 20], 'y': [np.nan,4,6,9]}
X = pd.DataFrame(d)
X

      x    y
0   5.0  NaN
1  10.0  4.0
2   NaN  6.0
3  20.0  9.0

üí° L'argument *weights* permet de pond√©rer la moyenne des voisins les plus proches leur distance de proximit√©.

In [360]:
from sklearn.impute import KNNImputer
imputer = KNNImputer(n_neighbors=2, weights="distance")
X = pd.DataFrame(imputer.fit_transform(X), columns = X.columns)
X

      x     y
0   5.0  5.25
1  10.0  4.00
2  14.0  6.00
3  20.0  9.00

‚ö† Cette m√©thode ne fonctionne que sur des variables num√©riques !

### G√©rer les doublons

On remarque que certaines personnes sont pr√©sentes deux fois

In [361]:
df_counts_name = df.Name.value_counts()
df_counts_name

Kelly, Mr James                     2
Connolly, Miss Kate                 2
Carlsson, Mr Frans Olof             2
Thayer, Mr John Borland, jr         1
Butt, Major Archibald Willingham    1
                                   ..
Driscoll, Miss Bridget              1
Boulos, Miss Laura                  1
Nasser (Nasrallah), Mrs Nicholas    1
Hampe, Mr Leon                      1
Angheloff, Mr Minko                 1
Name: Name, Length: 753, dtype: int64

On r√©cup√®re le nom des personnes en doublon avec la m√©thode *index*

In [362]:
doublons = df_counts_name[ df_counts_name > 1].index
print(doublons)

Index(['Kelly, Mr James', 'Connolly, Miss Kate', 'Carlsson, Mr Frans Olof'], dtype='object')

On filtre le data frame sur les doublons pour observer s'il y a bien une erreur ou s'il s'agit d'homonyme

In [363]:
df_doublons = df[df.Name.isin(doublons)]
df_doublons

                        Name PClass   Age     Sex  Survived  SexCode
44   Carlsson, Mr Frans Olof    1st  33.0    male         0        0
707  Carlsson, Mr Frans Olof    3rd  33.0    male         0        0
728      Connolly, Miss Kate    3rd  30.0  female         0        1
729      Connolly, Miss Kate    3rd  22.0  female         1        1
921          Kelly, Mr James    3rd  44.0    male         0        0
922          Kelly, Mr James    3rd  42.0    male         0        0

Pour illustrer les m√©thodes pour d√©doubloner, on travaille sur le dataset *df_doublons*

La premi√®re m√©thode consiste √† supprimer les doublons bas√©s sur une seule colonne

In [364]:
df_doublons.drop_duplicates(subset=['Name'])

                        Name PClass   Age     Sex  Survived  SexCode
44   Carlsson, Mr Frans Olof    1st  33.0    male         0        0
728      Connolly, Miss Kate    3rd  30.0  female         0        1
921          Kelly, Mr James    3rd  44.0    male         0        0

La deuxi√®me m√©thode consiste √† supprimer les doublons bas√©s sur plusieurs colonnes √† la fois

In [365]:
df_doublons

                        Name PClass   Age     Sex  Survived  SexCode
44   Carlsson, Mr Frans Olof    1st  33.0    male         0        0
707  Carlsson, Mr Frans Olof    3rd  33.0    male         0        0
728      Connolly, Miss Kate    3rd  30.0  female         0        1
729      Connolly, Miss Kate    3rd  22.0  female         1        1
921          Kelly, Mr James    3rd  44.0    male         0        0
922          Kelly, Mr James    3rd  42.0    male         0        0

In [366]:
df_doublons.drop_duplicates(subset=['Name',"PClass"])

                        Name PClass   Age     Sex  Survived  SexCode
44   Carlsson, Mr Frans Olof    1st  33.0    male         0        0
707  Carlsson, Mr Frans Olof    3rd  33.0    male         0        0
728      Connolly, Miss Kate    3rd  30.0  female         0        1
921          Kelly, Mr James    3rd  44.0    male         0        0

Les deux derni√®res m√©thodes consistent √† supprimer les doublons selon leur position dans le data frame en utilisant la m√©thode *groupby()* avec *tail()* ou *nth()*

On s√©lectionne la premi√®re ligne ou appara√Æt le doublon

In [367]:
df_doublons.groupby('Name').nth(0)

                        PClass   Age     Sex  Survived  SexCode
Name
Carlsson, Mr Frans Olof    1st  33.0    male         0        0
Connolly, Miss Kate        3rd  30.0  female         0        1
Kelly, Mr James            3rd  44.0    male         0        0

On s√©lectionne les x derni√®res lignes ou appara√Æt le doublon

In [368]:
df_doublons.groupby('Name').tail(1)

                        Name PClass   Age     Sex  Survived  SexCode
707  Carlsson, Mr Frans Olof    3rd  33.0    male         0        0
729      Connolly, Miss Kate    3rd  22.0  female         1        1
922          Kelly, Mr James    3rd  42.0    male         0        0

### Cr√©er de nouvelle variables

#### Discr√©tisation

La m√©thode *cut()* permet de d√©couper une variable num√©rique en tranche

In [369]:
pd.cut(df.Age, bins = [0,18,40,150])

0       (18, 40]
1        (0, 18]
2       (18, 40]
3       (18, 40]
4        (0, 18]
          ...
1308    (18, 40]
1309    (18, 40]
1310    (18, 40]
1311    (18, 40]
1312    (18, 40]
Name: Age, Length: 756, dtype: category
Categories (3, interval[int64]): [(0, 18] < (18, 40] < (40, 150]]

‚ö† L'argument *include_lowest* est important pour prendre en compte la plus petite borne inf√©rieure

In [370]:
pd.cut(df.Age, bins = [0,18,40,150], include_lowest=True)

0         (18.0, 40.0]
1       (-0.001, 18.0]
2         (18.0, 40.0]
3         (18.0, 40.0]
4       (-0.001, 18.0]
             ...
1308      (18.0, 40.0]
1309      (18.0, 40.0]
1310      (18.0, 40.0]
1311      (18.0, 40.0]
1312      (18.0, 40.0]
Name: Age, Length: 756, dtype: category
Categories (3, interval[float64]): [(-0.001, 18.0] < (18.0, 40.0] < (40.0, 150.0]]

On cr√©e une colonne avec ce d√©coupage en ajoutant des labels

In [371]:
df['Age_cut'] = pd.cut(df.Age, bins = [0,18,40,150],
                       labels=['moins de 18','entre 19 et 40','plus de 40'],
                       include_lowest=True)

On affiche un tri √† plat en triant selon les index avec la m√©thode *sort_index()*

In [372]:
df['Age_cut'].value_counts().sort_index()

moins de 18       126
entre 19 et 40    456
plus de 40        174
Name: Age_cut, dtype: int64

#### Recodage de variables

On peut utiliser la m√©thode *where()* de la librarie numpy

In [373]:
df['PClass_category'] = np.where(df['PClass'] == '1st', '1st', '2nd and 3rd')
df['PClass_category'].value_counts()

2nd and 3rd    530
1st            226
Name: PClass_category, dtype: int64

La m√©thode *get_dummies()* permet de construire un condage disjonctif complet (appel√© aussi *one-hot encoding*). Cela est tr√©s utilis√© en data science pour traiter les variables qualitatives en machine learning

In [374]:
pd.get_dummies(df, columns=['PClass','Sex']).head(3)

,Name,Age,Survived,SexCode,Age_cut,PClass_category,PClass_1st,PClass_2nd,PClass_3rd,Sex_female,Sex_male
0,"Allen, Miss Elisabeth Walton",29.0,1,1,entre 19 et 40,1st,1,0,0,1,0
1,"Allison, Miss Helen Loraine",2.0,0,1,moins de 18,1st,1,0,0,1,0
2,"Allison, Mr Hudson Joshua Creighton",30.0,0,0,entre 19 et 40,1st,1,0,0,0,1

‚ö† Cr√©er autant de colonne que de modalit√© est probl√©matique car on ajoute des colonnes qui ne sont plus ind√©pendante. C'est pourquoi en machine learning on cr√©e plutot K-1 indicatrices, la derni√®re modalit√© √©tant d√©duite des autres. L'argument *drop_first* permet de g√©rer cela.

In [375]:
df = pd.get_dummies(df, columns=['PClass','Sex'], drop_first=True)
df.head(3)

,Name,Age,Survived,SexCode,Age_cut,PClass_category,PClass_2nd,PClass_3rd,Sex_male
0,"Allen, Miss Elisabeth Walton",29.0,1,1,entre 19 et 40,1st,0,0,0
1,"Allison, Miss Helen Loraine",2.0,0,1,moins de 18,1st,0,0,0
2,"Allison, Mr Hudson Joshua Creighton",30.0,0,0,entre 19 et 40,1st,0,0,1

## Exporter le jeu de donn√©es

On exporte le data frame avec la m√©thode to_*mon_format*() selon l'extension du fichier

In [376]:
#df.to_csv("mon_Titanic.csv", index = False)

In [377]:
# df.to_excel(excel_writer = "Titanic.xlsx" , 
#             sheet_name = "Feuil1", index=False)

## Cr√©er un objet pandas

Pour c√©er une *Series* pandas on utilise la m√©thode *Series()*

In [378]:
#Creation des S√©ries   
ls_prenom = pd.Series(["Wilfried", "Alex", "Morgane", "Etienne", "C√©lia", "Baptiste", "Anthony", "Fred"])
ls_bi = pd.Series([15,9,12,15,6,14,11,19])
ls_dataviz = pd.Series([14,7,15,13,15,10,12,14])

print(ls_prenom)

0    Wilfried
1        Alex
2     Morgane
3     Etienne
4       C√©lia
5    Baptiste
6     Anthony
7        Fred
dtype: object

Pour c√©er un *DataFrame* pandas on utilise la m√©thode *DataFrame()*

In [379]:
d = {'Prenom': ls_prenom, 'BI': ls_bi, 'Dataviz' : ls_dataviz, 'Maths' : [5,20,11,13,5,14,12,16]}
df = pd.DataFrame(data=d)
df

     Prenom  BI  Dataviz  Maths
0  Wilfried  15       14      5
1      Alex   9        7     20
2   Morgane  12       15     11
3   Etienne  15       13     13
4     C√©lia   6       15      5
5  Baptiste  14       10     14
6   Anthony  11       12     12
7      Fred  19       14     16

## Les options pandas

Il est possible de modifier les options d'affichage avec la gestion des options de la librairie pandas

In [380]:
#gerer le nombre de ligne √† afficher
pd.set_option("display.min_rows", 2)

In [381]:
#g√©rer le nombre de colonne √† afficher
pd.set_option("display.max_columns", 4)

In [382]:
#g√©rer la largeur des colonnes
pd.set_option('max_colwidth', 5)

In [383]:
df

  Prenom  BI  Dataviz  Maths
0  W...   15    14        5
1  Alex    9     7       20
2  M...   12    15       11
3  E...   15    13       13
4  C...    6    15        5
5  B...   14    10       14
6  A...   11    12       12
7  Fred   19    14       16

La m√©thode *reset_option()* permet de r√©initialiser les param√®tres

In [384]:
pd.reset_option(("^display"))

In [385]:
df

     Prenom  BI  Dataviz  Maths
0  Wilfried  15       14      5
1      Alex   9        7     20
2   Morgane  12       15     11
3   Etienne  15       13     13
4     C√©lia   6       15      5
5  Baptiste  14       10     14
6   Anthony  11       12     12
7      Fred  19       14     16

Plus d'information sur la librairie pandas avec le cours de Kaggle : https://www.kaggle.com/learn/pandas

#### Pandas Profiling

Lancer la ligne de commande dans un terminal, une mise √† jour de conda est peut √™tre n√©cessaire

In [386]:
#conda install -c conda-forge pandas-profiling

In [387]:
# import pandas_profiling

In [388]:
# profile = pandas_profiling.ProfileReport(df, title='Pandas Profiling Report', explorative=True)

In [389]:
# profile